willbearfruits/esp32-s3-supermini-kit/firmware/sdkconfig.defaults
# ESP32-S3 SuperMini (ESP32-S3FH4R2: 4 MB flash, 2 MB PSRAM)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# The SuperMini's USB-C goes straight to the S3's native USB.
# Route the console through USB Serial/JTAG so `idf.py monitor` just works.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
